OdDAI.OdSDAIInstance.testAttr(OdSmartPtr&lt;OdDAI.Attribute&gt;!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Retrieves whether the attribute value is set or is unset.
\param attribute [in] an attribute type.
\returns Returns true if the attribute has a value; otherwise, the method returns false (it means that the attribute value is not set).

OdDAI.OdSDAIInstance.testAttr(System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst*)
\details
Retrieves whether the attribute value is set or is unset.
\param explicitAttrName [in] An ANSI string that contains the attribute name.
\returns Returns true if the attribute has a value; otherwise, the method returns false (it means that the attribute value is not set).

OdDAI.OdSDAIInstance.getAttr(System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst*)
\details
Retrieves the current value of an attribute specified by its name.
\param attrName [in] An ANSI string that contains the attribute name.
\returns Returns the current value of the attribute.
\remarks
The method provides the late binding access to the attribute value by its name.
Attributes of select and aggregate data types are also supported.

OdDAI.OdSDAIInstance.isKindOf(System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst*)
\details
Retrieves whether the SDAI instance belongs to a certain entity type with a specified name.
\param entityName [in] A name of entities type.
\returns Returns true if the SDAI instance belongs to the type of entity with the specified name; otherwise, the method returns false.

OdDAI.OdSDAIInstance.isInstanceOf(System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst*)
\details
Retrieves whether the SDAI instance is an instance of an instance type with a specified name.
\param entityName [in] An entity's type name.
\returns Returns true if the SDAI instance is an instance of the specified type; otherwise, the method returns false.

OdDAI.OdSDAIInstance.owningModel
\details
Retrieves the model that contains the SDAI instance.
\returns Returns a raw pointer to the owning model; if the SDAI instance is not appended to any model, the method returns a NULL pointer.